output/2023-07-30-04-42.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.058 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        1214000
HTML transferred:       18000 bytes
Requests per second:    17363.82 [#/sec] (mean)
Time per request:       5.759 [ms] (mean)
Time per request:       0.058 [ms] (mean, across all concurrent requests)
Transfer rate:          2967.45 [Kbytes/sec] received
                        20585.63 kb/s sent
                        23553.08 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     1    5   3.5      3      15
Waiting:        1    5   3.5      3      15
Total:          1    5   4.0      3      18
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.032 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        1214000
HTML transferred:       18000 bytes
Requests per second:    31603.56 [#/sec] (mean)
Time per request:       3.164 [ms] (mean)
Time per request:       0.032 [ms] (mean, across all concurrent requests)
Transfer rate:          5401.00 [Kbytes/sec] received
                        37467.51 kb/s sent
                        42868.51 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       3
Processing:     0    3   2.9      2      12
Waiting:        0    3   2.9      2      12
Total:          0    3   3.7      2      14
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.035 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        2238000
HTML transferred:       18000 bytes
Requests per second:    28338.25 [#/sec] (mean)
Time per request:       3.529 [ms] (mean)
Time per request:       0.035 [ms] (mean, across all concurrent requests)
Transfer rate:          4842.96 [Kbytes/sec] received
                        61934.56 kb/s sent
                        66777.53 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     0    3   2.9      2      12
Waiting:        0    3   2.9      2      12
Total:          0    3   3.9      2      16
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.047 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        4286000
HTML transferred:       18000 bytes
Requests per second:    21263.93 [#/sec] (mean)
Time per request:       4.703 [ms] (mean)
Time per request:       0.047 [ms] (mean, across all concurrent requests)
Transfer rate:          3633.97 [Kbytes/sec] received
                        89001.17 kb/s sent
                        92635.14 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       5
Processing:     0    4   2.5      3      13
Waiting:        0    4   2.5      3      13
Total:          0    4   3.5      3      16
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.029 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        8382000
HTML transferred:       18000 bytes
Requests per second:    33955.86 [#/sec] (mean)
Time per request:       2.945 [ms] (mean)
Time per request:       0.029 [ms] (mean, across all concurrent requests)
Transfer rate:          5803.00 [Kbytes/sec] received
                        277947.26 kb/s sent
                        283750.27 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       4
Processing:     0    2   0.8      2       4
Waiting:        0    2   0.8      2       4
Total:          0    3   1.7      2       8
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.036 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        16575000
HTML transferred:       18000 bytes
Requests per second:    27755.42 [#/sec] (mean)
Time per request:       3.603 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          4743.36 [Kbytes/sec] received
                        449263.74 kb/s sent
                        454007.10 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       5
Processing:     1    3   2.8      2      12
Waiting:        1    3   2.8      2      12
Total:          1    3   3.6      2      14
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.044 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        32959000
HTML transferred:       18000 bytes
Requests per second:    22965.28 [#/sec] (mean)
Time per request:       4.354 [ms] (mean)
Time per request:       0.044 [ms] (mean, across all concurrent requests)
Transfer rate:          3924.73 [Kbytes/sec] received
                        739172.41 kb/s sent
                        743097.14 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       5
Processing:     0    3   4.0      2      16
Waiting:        0    3   4.0      2      16
Total:          0    4   5.2      2      20
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        18 bytes

Concurrency Level:      100
Time taken for tests:   0.046 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Keep-Alive requests:    1000
Total transferred:      175000 bytes
Total body sent:        65727000
HTML transferred:       18000 bytes
Requests per second:    21890.46 [#/sec] (mean)
Time per request:       4.568 [ms] (mean)
Time per request:       0.046 [ms] (mean, across all concurrent requests)
Transfer rate:          3741.05 [Kbytes/sec] received
                        1405072.53 kb/s sent
                        1408813.58 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       4
Processing:     0    4   4.4      2      20
Waiting:        0    4   4.4      2      20
Total:          0    4   5.2      2      24